Repository: EternalTimes/wslcontainerdesktop
Catalog: src/WslContainerDesktop/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# Workload_KubernetesPage_013.Text
source: Stop
zh_hans: 停止

# Workload_KubernetesPage_014.Text
source: Upgrade
zh_hans: 升级

# Workload_KubernetesPage_015.Text
source: Uninstall
zh_hans: 卸载

# Workload_KubernetesPage_016.Text
source: No Kubernetes cluster yet
zh_hans: 尚无 Kubernetes 集群

# Workload_KubernetesPage_017.Text
source: Install a lightweight single-node Kubernetes cluster (k3s) that runs inside your WSL distro. It uses its own container runtime, installs as a service, and can be fully uninstalled at any time.
zh_hans: 安装在 WSL 发行版中运行的轻量级单节点 Kubernetes 集群（k3s）。它使用独立的容器运行时，以服务形式安装，随时可以完整卸载。

# Workload_KubernetesPage_018.Text
source: Install Kubernetes (k3s)
zh_hans: 安装 Kubernetes（k3s）

# Workload_KubernetesPage_019.Content
source: How to install a distribution
zh_hans: 如何安装发行版

# Workload_KubernetesPage_020.Content
source: Use the default distribution
zh_hans: 使用默认发行版

source: Stop using the distribution configured for Kubernetes and use WSL's default distribution instead.
zh_hans: 停用为 Kubernetes 配置的发行版，改用 WSL 默认发行版。

# Workload_KubernetesPage_021.Text
source: Refresh
zh_hans: 刷新

# Workload_KubernetesPage_022.Content
source: Hide log
zh_hans: 隐藏日志

# Workload_KubernetesPage_023.Text
source: Cluster is stopped. Click Start to bring it up.
zh_hans: 集群已停止。点击“启动”以启动集群。

# Workload_KubernetesPage_024.Text
source: k3s is starting. This usually takes a few seconds.
zh_hans: k3s 正在启动，通常需要几秒钟。

# Workload_KubernetesPage_025.Text
source: Namespace:
zh_hans: 命名空间：

source: Deploy a Kubernetes YAML manifest
zh_hans: 部署 Kubernetes YAML 清单

# Workload_KubernetesPage_027.Text
source: Apply YAML
zh_hans: 应用 YAML

# Workload_KubernetesPage_028.Text
source: NAME
zh_hans: 名称

# Workload_KubernetesPage_029.Text
source: STATUS
zh_hans: 状态

# Workload_KubernetesPage_030.Text
source: ROLES
zh_hans: 角色

# Workload_KubernetesPage_031.Text
source: VERSION
zh_hans: 版本

# Workload_KubernetesPage_032.Text
source: NAME
zh_hans: 名称

# Workload_KubernetesPage_033.Text
source: NAMESPACE
zh_hans: 命名空间

# Workload_KubernetesPage_034.Text
source: READY
zh_hans: 就绪

# Workload_KubernetesPage_035.Text
source: ACTIONS
zh_hans: 操作

# Workload_KubernetesPage_039.Text
source: NAME
zh_hans: 名称

# Workload_KubernetesPage_040.Text
source: NAMESPACE
zh_hans: 命名空间

# Workload_KubernetesPage_041.Text
source: STATUS
zh_hans: 状态

# Workload_KubernetesPage_042.Text
source: READY
zh_hans: 就绪

# Workload_KubernetesPage_043.Text
source: RESTARTS
zh_hans: 重启次数

# Workload_KubernetesPage_045.Text
source: NAME
zh_hans: 名称

# Workload_KubernetesPage_046.Text
source: NAMESPACE
zh_hans: 命名空间

# Workload_KubernetesPage_047.Text
source: TYPE
zh_hans: 类型

# Workload_KubernetesPage_048.Text
source: CLUSTER IP
zh_hans: 集群 IP

# Workload_KubernetesPage_049.Text
source: PORTS
zh_hans: 端口

# Workload_KubernetesPage_051.Text
source: NAME
zh_hans: 名称

# Workload_KubernetesPage_052.Text
source: NAMESPACE
zh_hans: 命名空间

# Workload_KubernetesPage_053.Text
source: CLASS
zh_hans: 类别

# Workload_KubernetesPage_054.Text
source: HOSTS
zh_hans: 主机

# Workload_KubernetesPage_055.Text
source: No ingresses.
zh_hans: 没有入口。

# Workload_KubernetesPage_057.Text
source: NAME
zh_hans: 名称

# Workload_KubernetesPage_058.Text
source: NAMESPACE
zh_hans: 命名空间

# Workload_KubernetesPage_059.Text
source: STATUS
zh_hans: 状态

# Workload_KubernetesPage_060.Text
source: CAPACITY
zh_hans: 容量

# Workload_KubernetesPage_061.Text
source: STORAGE CLASS
zh_hans: 存储类

# Workload_KubernetesPage_062.Text
source: No persistent volume claims.
zh_hans: 没有持久卷声明。

# Workload_KubernetesPage_064.Text
source: NAME
zh_hans: 名称

# Workload_KubernetesPage_065.Text
source: NAMESPACE
zh_hans: 命名空间

# Workload_KubernetesPage_066.Text
source: KEYS
zh_hans: 键数

# Workload_KubernetesPage_068.Text
source: NAME
zh_hans: 名称

# Workload_KubernetesPage_069.Text
source: NAMESPACE
zh_hans: 命名空间

# Workload_KubernetesPage_070.Text
source: TYPE
zh_hans: 类型

# Workload_KubernetesPage_071.Text
source: KEYS
zh_hans: 键数

# Workload_KubernetesPage_073.Text
source: NAME
zh_hans: 名称

# Workload_KubernetesPage_074.Text
source: NAMESPACE
zh_hans: 命名空间

# Workload_KubernetesPage_075.Text
source: COMPLETIONS
zh_hans: 完成数

# Workload_KubernetesPage_076.Text
source: No jobs.
zh_hans: 没有任务。

# Workload_KubernetesPage_078.Text
source: NAME
zh_hans: 名称

# Workload_KubernetesPage_079.Text
source: NAMESPACE
zh_hans: 命名空间

# Workload_KubernetesPage_080.Text
source: SCHEDULE
zh_hans: 计划

# Workload_KubernetesPage_081.Text
source: ACTIVE
zh_hans: 活动

# Workload_KubernetesPage_082.Text
source: No cronjobs.
zh_hans: 没有定时任务。

# Workload_KubernetesPage_086.Text
source: Forward a port
zh_hans: 转发端口

# Workload_KubernetesPage_087.Text
source: No active port forwards. Click "Forward a port" to expose a pod or service on localhost.
zh_hans: 没有活动的端口转发。点击“转发端口”可将 Pod 或服务开放到 localhost。

source: Open in browser
zh_hans: 在浏览器中打开

source: Stop
zh_hans: 停止

# Workload_TemplatesPage_001.Text
source: Templates
zh_hans: 模板

# Workload_TemplatesPage_002.Text
source: One-click stacks — launch a common image or multi-service project in seconds.
zh_hans: 一键启动常用镜像或多服务项目。

source: New template
zh_hans: 新建模板

source: Create a new custom template
zh_hans: 创建自定义模板

# Workload_TemplatesPage_004.Text
source: New template
zh_hans: 新建模板

source: Import templates
zh_hans: 导入模板

source: Import templates from a file
zh_hans: 从文件导入模板

# Workload_TemplatesPage_006.Text
source: Import
zh_hans: 导入

source: Export all custom templates
zh_hans: 导出所有自定义模板

source: Export your custom and imported templates to a file
zh_hans: 将自定义和导入的模板导出到文件

# Workload_TemplatesPage_008.Text
source: Export all
zh_hans: 全部导出

# Workload_TemplatesPage_009.OffContent
source: Show hidden
zh_hans: 显示已隐藏的内容

# Workload_TemplatesPage_009.OnContent
source: Show hidden
zh_hans: 显示已隐藏的内容

# Workload_TemplatesPage_010.Text
source: Deployed
zh_hans: 已部署

# Workload_TemplatesPage_011.Text
source: Launch
zh_hans: 启动

# Workload_TemplatesPage_012.Text
source: Launching…
zh_hans: 正在启动…

source: More actions
zh_hans: 更多操作

# Workload_TemplatesPage_014.Text
source: Configure…
zh_hans: 配置…

# Workload_TemplatesPage_015.Text
source: Duplicate…
zh_hans: 复制…

# Workload_TemplatesPage_016.Text
source: Edit…
zh_hans: 编辑…

# Workload_TemplatesPage_017.Text
source: Export…
zh_hans: 导出…

# Workload_TemplatesPage_018.Text
source: Remove deployment
zh_hans: 移除部署

# Workload_TemplatesPage_019.Text
source: Hide
zh_hans: 隐藏

# Workload_TemplatesPage_020.Text
source: Unhide
zh_hans: 取消隐藏

# Workload_TemplatesPage_021.Text
source: Delete template
zh_hans: 删除模板

# Workload_Text_0_1_See_it_in_the_60c2ff
source: {0}{1}. See it in the Containers view.
zh_hans: {0}{1}。可在“容器”页面查看。

# Workload_Text_0_1_cancelled_969bd2
source: {0} "{1}" cancelled.
zh_hans: 已取消{0}“{1}”。

# Workload_Text_0_1_needing_attention_0540b9
source: {0} {1} needing attention
zh_hans: {0} 项{1}需要注意

# Workload_Text_0_1_removed_ae80f8
source: {0}{1} removed.
zh_hans: 已移除 {0}{1}。

# Workload_Text_0_applied_1_instance_s_started_b61588
source: "{0}" applied — {1} instance(s) started
zh_hans: 已应用“{0}” — 已启动 {1} 个实例

# Workload_Text_0_apply_incomplete_1_instance_s_c1d8d4
source: "{0}" apply incomplete — {1} instance(s) started
zh_hans: “{0}”未完全应用 — 已启动 {1} 个实例

# Workload_Text_0_blocking_1_8133a5
source: {0} blocking {1}
zh_hans: {0} 个阻止操作的{1}

# Workload_Text_0_blocking_1_and_2_3_e38847
source: {0} blocking {1} and {2} {3} needing attention
zh_hans: {0} 个阻止操作的{1}，{2} 项{3}需要注意

# Workload_Text_0_completed_for_1_b46404
source: {0} completed for "{1}"
zh_hans: 已完成“{1}”的{0}

# Workload_Text_0_copy_c24257
source: {0} (copy)
zh_hans: {0}（副本）

# Workload_Text_0_desired_replicas_95c372
source: {0} — desired replicas
zh_hans: {0} — 目标副本数

# Workload_Text_0_dev_container_s_88a6a2
source: {0} dev container(s)
zh_hans: {0} 个开发容器

# Workload_Text_0_failed_47953d
source: {0}: failed
zh_hans: {0}：失败

# Workload_Text_0_for_1_some_services_failed_553312
source: {0} for "{1}" — some services failed
zh_hans: “{1}”的{0}操作中有部分服务失败

# Workload_Text_0_has_1_service_s_Review_6f59f1
source: "{0}" has {1} service(s). Review compatibility before applying, or save an import without starting it. App-owned restart and health supervision require this app to remain open.
zh_hans: “{0}”包含 {1} 个服务。请先检查兼容性再应用，也可以仅保存导入而不启动。 应用管理的重启和健康监控需要保持本应用运行。

# Workload_Text_0_imported_1_a03a98
source: {0} (imported {1})
zh_hans: {0}（已导入 {1}）

# Workload_Text_0_imported_d226e7
source: {0} (imported)
zh_hans: {0}（已导入）

# Workload_Text_0_instance_s_started_83484d
source: — {0} instance(s) started
zh_hans: — 已启动 {0} 个实例

# Workload_Text_0_is_already_deployed_314a85
source: {0} is already deployed
zh_hans: {0} 已部署

# Workload_Text_0_is_down_5a240a
source: "{0}" is down
zh_hans: “{0}”已停止

# Workload_Text_0_is_ready_with_1_2_12e6ac
source: {0} is ready with {1}{2}{3}.
zh_hans: {0} 已就绪，模型为 {1}{2}{3}。

# Workload_Text_0_launched_1_See_it_in_2da307
source: {0} launched{1}. See it in the Containers view.
zh_hans: {0} 已启动{1}。可在“容器”页面查看。

# Workload_Text_0_launched_680a32
source: {0} launched
zh_hans: {0} 已启动

# Workload_Text_0_launched_using_the_existing_1_ee72be
source: {0} launched using the existing "{1}" runtime{2}.
zh_hans: {0} 已使用现有“{1}”运行时启动{2}。

# Workload_Text_0_launched_without_a_model_1_c556f5
source: {0} launched without a model{1}{2}. Add one from the web UI before chatting.
zh_hans: {0} 已启动，尚无模型{1}{2}。开始对话前请在网页界面中添加模型。

# Workload_Text_0_namespace_1_f105f4
source: {0} · namespace {1}
zh_hans: {0} · 命名空间 {1}

# Workload_Text_0_project_s_53276f
source: {0} project(s)
zh_hans: {0} 个项目

# Workload_Text_0_repositories_select_one_to_see_99bbab
source: {0} repositories — select one to see its tags.
zh_hans: {0} 个仓库 — 请选择仓库以查看标签。

# Workload_Text_0_restart_incomplete_1_instance_s_5a55f5
source: "{0}" restart incomplete — {1} instance(s) started
zh_hans: “{0}”未完全重启 — 已启动 {1} 个实例

# Workload_Text_0_restarted_1_instance_s_started_d1b2df
source: "{0}" restarted — {1} instance(s) started
zh_hans: 已重启“{0}” — 已启动 {1} 个实例

# Workload_Text_0_select_a_tag_to_fill_2892ab
source: {0}: select a tag to fill the image reference.
zh_hans: {0}：选择标签以填写镜像引用。

# Workload_Text_0_started_43003e
source: {0} started
zh_hans: {0} 已启动

# Workload_Text_0_started_as_1_d8356c
source: {0} started as "{1}"
zh_hans: {0} 已以“{1}”启动

# Workload_Text_0_started_but_1_could_not_6165d9
source: {0} started, but "{1}" could not join the {2} network, so no models will appear. Connect it from the Networks page.
zh_hans: {0} 已启动，但“{1}”无法加入 {2} 网络，因此不会显示模型。请在“网络”页面连接它。

# Workload_Text_0_started_but_1_could_not_c04bc8
source: {0} started, but {1} could not be downloaded. Open the web UI and pull a model there, or retry from the container's terminal.
zh_hans: {0} 已启动，但无法下载 {1}。请在网页界面中拉取模型，或从容器终端重试。

# Workload_Text_0_warning_s_d02ebe
source: {0} warning(s)
zh_hans: {0} 条警告

# Workload_Text_ACTIONS_1ba13a
source: ACTIONS
zh_hans: 操作

# Workload_Text_ACTIVE_630c2f
source: ACTIVE
zh_hans: 活动

# Workload_Text_A_browser_will_open_for_Azure_2f9f14
source: A browser will open for Azure sign-in…
zh_hans: 即将打开浏览器以登录 Azure…

# Workload_Text_A_one_off_job_was_created_8a1a9c
source: A one-off job was created from this cronjob.
zh_hans: 已从此定时任务创建一次性任务。

# Workload_Text_Add_9fd728
source: Add
zh_hans: 添加

# Workload_Text_Add_Azure_Container_Registry_d0b1c7
source: Add Azure Container Registry
zh_hans: 添加 Azure Container Registry

# Workload_Text_Add_registry_503bed
source: Add registry
zh_hans: 添加镜像仓库

# Workload_Text_Add_them_after_loading_the_profile_e0266e
source: . Add them after loading the profile if needed.
zh_hans: 。如有需要，请在加载配置后添加。

# Workload_Text_Advanced_options_9443ff
source: Advanced options
zh_hans: 高级选项

# Workload_Text_Aliases_optional_comma_or_line_separated_73fe58
source: Aliases (optional, comma or line separated)
zh_hans: 别名（可选，以逗号或换行分隔）

# Workload_Text_All_namespaces_50c3cb
source: All namespaces
zh_hans: 所有命名空间

# Workload_Text_All_resolved_settings_0_442b43
source: All resolved settings ({0})
zh_hans: 所有解析后的设置（{0}）

# Workload_Text_All_tags_7c39c1
source: All tags
zh_hans: 所有标签

# Workload_Text_Also_delete_data_volumes_permanently_deletes_c126ec
source: Also delete data volumes (permanently deletes stored data)
zh_hans: 同时删除数据卷（永久删除已保存的数据）

# Workload_Text_Apply_0_9d7f20
source: Apply: {0}
zh_hans: 应用：{0}

# Workload_Text_Apply_31e392
source: Apply
zh_hans: 应用

# Workload_Text_Apply_YAML_a1e57e
source: Apply YAML
zh_hans: 应用 YAML

# Workload_Text_Apply_YAML_manifest_72cc14
source: Apply YAML manifest
zh_hans: 应用 YAML 清单

# Workload_Text_Apply_changes_to_cluster_bf94e3
source: Apply changes to cluster
zh_hans: 将更改应用到集群

# Workload_Text_Apply_configuration_to_the_selected_services_c06fac
source: Apply configuration to the selected services and their required dependency closure. Unchanged running containers are kept; stopped containers are started and changed containers may be recreated. Replicas are local instances, not a Swarm deployment. Zero removes all selected instances. Named volumes and bind mounts are shared; anonymous volumes belong to each instance and are preserved on recreation. Scaling down does not delete volumes. A local operation plans at most {0} total instances.
zh_hans: 将配置应用到选中的服务及其必需的依赖服务。未更改且运行中的容器将保留；已停止的容器将启动，更改过的容器可能重新创建。副本是本地实例，并非 Swarm 部署。设为零会移除选中的所有实例。命名数据卷和绑定挂载共享使用；匿名数据卷属于各实例，重新创建时将保留。缩容不会删除数据卷。单次本地操作最多规划 {0} 个实例。

# Workload_Text_Apply_failed_cae4cf
source: Apply failed
zh_hans: 应用失败

# Workload_Text_Apply_reviewed_plan_844b63
source: Apply reviewed plan
zh_hans: 应用已检查的计划

# Workload_Text_Apply_up_e6346a
source: Apply (up)
zh_hans: 应用（启动）

# Workload_Text_Approve_and_continue_e94a79
source: Approve and continue
zh_hans: 批准并继续

# Workload_Text_Attach_an_existing_volume_5d60f4
source: Attach an existing volume
zh_hans: 挂载现有数据卷

# Workload_Text_Auto_restarts_before_alerting_0_alert_171ebb
source: Auto-restarts before alerting (0 = alert only)
zh_hans: 发出警报前自动重启次数（0 表示仅警报）

# Workload_Text_Azure_sign_in_did_not_complete_76688f
source: Azure sign-in did not complete. Try again.
zh_hans: Azure 登录未完成。请重试。

# Workload_Text_Back_to_Kubernetes_4d2ef9
source: Back to Kubernetes
zh_hans: 返回 Kubernetes

# Workload_Text_Bring_down_151b4b
source: Bring down
zh_hans: 停止并删除容器

# Workload_Text_Bring_down_failed_da796d
source: Bring down failed
zh_hans: 停止失败

# Workload_Text_Bring_project_down_1ebeb2
source: Bring project down
zh_hans: 停止项目

# Workload_Text_Bring_up_050a84
source: Bring up
zh_hans: 启动

# Workload_Text_Bring_up_failed_1f4ce8
source: Bring up failed
zh_hans: 启动失败

# Workload_Text_Bringing_down_0_952aea
source: Bringing down "{0}"…
zh_hans: 正在停止“{0}”…

# Workload_Text_Bringing_up_0_fc2ceb
source: Bringing up "{0}"…
zh_hans: 正在启动“{0}”…

# Workload_Text_Browse_93c6b6
source: Browse…
zh_hans: 浏览…

# Workload_Text_Browse_for_a_yaml_file_e5c7af
source: Browse for a .yaml file…
zh_hans: 浏览 .yaml 文件…

# Workload_Text_Browsing_isn_t_available_for_this_14704e
source: Browsing isn't available for this registry — enter a reference manually
zh_hans: 此镜像仓库不支持浏览，请手动输入镜像引用

# Workload_Text_Build_0_413948
source: Build: {0}
zh_hans: 构建：{0}

# Workload_Text_Build_bdd254
source: Build
zh_hans: 构建

# Workload_Text_Build_image_327d5c
source: Build image
zh_hans: 构建镜像

# Workload_Text_Builds_0_on_this_PC_Nothing_c00a00
source: Builds {0} on this PC. Nothing is uploaded; use Push later if you want to share it.
zh_hans: 在此计算机上构建 {0}，不会上传。如需分享，可稍后使用“推送”。

# Workload_Text_Builds_0_on_this_PC_named_748512
source: Builds {0} on this PC, named so it is ready to push. Nothing is uploaded until you use Push.
zh_hans: 在此计算机上构建 {0}，并命名为可直接推送的格式。使用“推送”前不会上传。

# Workload_Text_CAPACITY_f9c3ed
source: CAPACITY
zh_hans: 容量

# Workload_Text_CLASS_bb6a38
source: CLASS
zh_hans: 类别

# Workload_Text_CLUSTER_IP_9027ea
source: CLUSTER IP
zh_hans: 集群 IP

# Workload_Text_COMPLETIONS_d127b0
source: COMPLETIONS
zh_hans: 完成数

# Workload_Text_Cancel_19766e
source: Cancel
zh_hans: 取消

# Workload_Text_Cancel_to_keep_profiles_unchanged_or_64ca1c
source: Cancel to keep profiles unchanged, or save and review storage after loading the profile.
zh_hans: 取消可保留现有配置；也可以保存，并在加载配置后检查存储。

# Workload_Text_Cancelled_the_changed_installer_script_was_a25d67
source: Cancelled: the changed installer script was not approved.
zh_hans: 已取消：未批准更改后的安装脚本。

# Workload_Text_Cannot_determine_next_version_4cd9a9
source: Cannot determine next version
zh_hans: 无法确定下一个版本

# Workload_Text_Captured_settings_0eb697
source: Captured settings
zh_hans: 已获取的设置

# Workload_Text_Category_292c06
source: Category
zh_hans: 类别

# Workload_Text_Changes_applied_9cf6db
source: Changes applied
zh_hans: 已应用更改

# Workload_Text_Check_interval_seconds_c75f0b
source: Check interval (seconds)
zh_hans: 检查间隔（秒）

# Workload_Text_Checking_cluster_status_8c6339
source: Checking cluster status…
zh_hans: 正在检查集群状态…

# Workload_Text_Checking_for_the_Azure_CLI_244c64
source: Checking for the Azure CLI…
zh_hans: 正在检查 Azure CLI…

# Workload_Text_Checking_your_sign_in_to_0_5577aa
source: Checking your sign-in to {0}…
zh_hans: 正在检查 {0} 的登录状态…

# Workload_Text_Choose_a_compose_file_51e9a3
source: Choose a compose file…
zh_hans: 选择 Compose 文件…

# Workload_Text_Choose_a_container_registry_to_add_01c399
source: Choose a container registry to add.
zh_hans: 请选择要添加的容器镜像仓库。

# Workload_Text_Choose_a_model_78a7ab
source: Choose a model
zh_hans: 选择模型

# Workload_Text_Cluster_is_installed_but_stopped_4527a7
source: Cluster is installed but stopped.
zh_hans: 集群已安装但已停止。

# Workload_Text_Cluster_is_stopped_Click_Start_to_8df0dd
source: Cluster is stopped. Click Start to bring it up.
zh_hans: 集群已停止。点击“启动”以启动集群。

# Workload_Text_Cluster_running_node_0_1_4c9575
source: Cluster running · node {0} · {1}
zh_hans: 集群运行中 · 节点 {0} · {1}

# Workload_Text_Command_arguments_optional_410b03
source: Command / arguments (optional)
zh_hans: 请输入容器内的路径

# Workload_Text_Command_run_inside_the_container_2e8017
source: Command run inside the container
zh_hans: 在容器内执行的命令

# Workload_Text_Command_wslc_exec_exit_0_healthy_02b96a
source: Command (wslc exec, exit 0 = healthy)
zh_hans: 命令（wslc exec，退出码 0 表示健康）

# Workload_Text_Compose_compatibility_notes_7d8a36
source: Compose compatibility notes
zh_hans: Compose 兼容性说明

# Workload_Text_Compose_launch_was_cancelled_blocked_or_41a796
source: Compose launch was cancelled, blocked, or incomplete. Check Compose details and refresh actual state before retrying.
zh_hans: Compose 启动已取消、被阻止或未完成。请检查 Compose 详情并刷新实际状态后重试。

# Workload_Text_Compose_launch_was_cancelled_blocked_or_e9222d
source: Compose launch was cancelled, blocked, or incomplete. Saved template defaults were not changed; check Compose details.
zh_hans: Compose 启动已取消、被阻止或未完成。已保存的模板默认值未更改；请查看 Compose 详情。

# Workload_Text_Compose_stack_2c23f1
source: Compose stack
zh_hans: Compose 堆栈

# Workload_Text_ConfigMap_0fbccf
source: ConfigMap
zh_hans: 配置映射

# Workload_Text_ConfigMaps_54b4dd
source: ConfigMaps
zh_hans: 配置映射

# Workload_Text_Configuration_applied_to_the_cluster_270136
source: Configuration applied to the cluster.
zh_hans: 配置已应用到集群。

# Workload_Text_Configure_0_76d41c
source: Configure {0}
zh_hans: 配置 {0}

# Workload_Text_Configure_37d782
source: Configure…
zh_hans: 配置…

# Workload_Text_Confirm_operation_382ccb
source: Confirm operation
zh_hans: 确认操作

# Workload_Text_Connect_1a2303
source: Connect
zh_hans: 连接

# Workload_Text_Connect_to_network_13927e
source: Connect to network
zh_hans: 连接到网络

# Workload_Text_Container_name_optional_f0ba06
source: Container name (optional)
zh_hans: 容器名称（可选）

# Workload_Text_Container_registry_a1673a
source: Container registry
zh_hans: 容器镜像仓库

# Workload_Text_Container_status_unavailable_0_f892d1
source: - Container status unavailable: {0}
zh_hans: - 容器状态不可用：{0}

# Workload_Text_Continue_31fbef
source: Continue
zh_hans: 继续

# Workload_Text_Could_not_get_an_access_token_401d09
source: Could not get an access token for this registry. You may lack pull access, or the token expired.
zh_hans: 无法获取此镜像仓库的访问令牌。可能没有拉取权限，或令牌已过期。

# Workload_Text_Could_not_import_devcontainer_json_492691
source: Could not import devcontainer.json.
zh_hans: 无法导入 devcontainer.json。

# Workload_Text_Could_not_list_repositories_50d18d
source: Could not list repositories.
zh_hans: 无法列出仓库。

# Workload_Text_Could_not_list_tags_fe3b7c
source: Could not list tags.
zh_hans: 无法列出标签。

# Workload_Text_Could_not_read_the_selected_Compose_548673
source: Could not read the selected Compose file. Check its permissions.
zh_hans: 无法读取所选 Compose 文件。请检查文件权限。

# Workload_Text_Could_not_read_the_selected_file_50b46f
source: Could not read the selected file.
zh_hans: 无法读取所选文件。

# Workload_Text_Could_not_start_the_port_forward_84c580
source: Could not start the port-forward. Check that the target and ports are valid.
zh_hans: 无法启动端口转发。请检查目标和端口是否有效。

# Workload_Text_Couldn_t_confirm_your_sign_in_1c8432
source: Couldn't confirm your sign-in to {0}. You can still try the push.
zh_hans: 无法确认 {0} 的登录状态。仍可尝试推送。

# Workload_Text_Couldn_t_find_an_image_reference_3b55b5
source: Couldn't find an image reference in that command. Paste a full 'docker run … <image>' line.
zh_hans: 此命令中未找到镜像引用。请粘贴完整的“docker run … <image>”命令。

# Workload_Text_Couldn_t_reach_0_to_check_a88a1d
source: Couldn't reach {0} to check your sign-in. You can still try the push.
zh_hans: 无法连接 {0} 以检查登录状态。仍可尝试推送。

# Workload_Text_Create_475949
source: Create
zh_hans: 创建

# Workload_Text_Create_a_new_custom_template_963031
source: Create a new custom template
zh_hans: 创建自定义模板

# Workload_Text_Create_network_dbf4e6
source: Create network
zh_hans: 创建网络

# Workload_Text_Created_a_copy_e721ce
source: Created a copy
zh_hans: 已创建副本

# Workload_Text_Created_d70b9e
source: Created
zh_hans: 已创建

# Workload_Text_Credentials_are_handed_to_the_container_c9f29e
source: Credentials are handed to the container engine (wslc login) and stored in its credential store — the app never saves your password.
zh_hans: 凭据将交给容器引擎（wslc login）并保存到其凭据存储中；本应用不会保存您的密码。

# Workload_Text_CronJob_30db41
source: CronJob
zh_hans: 定时任务

# Workload_Text_CronJobs_a27995
source: CronJobs
zh_hans: 定时任务

# Workload_Text_Dashboard_67b696
source: Dashboard
zh_hans: 仪表板

# Workload_Text_Default_bridge_83f3d5
source: Default (bridge)
zh_hans: 默认（bridge）

# Workload_Text_Delete_0_1_This_cannot_be_0b19ba
source: Delete {0} "{1}"? This cannot be undone.
zh_hans: 删除 {0}“{1}”吗？此操作无法撤销。

# Workload_Text_Delete_0_7eab12
source: Delete {0}
zh_hans: 删除 {0}

# Workload_Text_Delete_e2d0a5
source: Delete
zh_hans: 删除

# Workload_Text_Delete_failed_8727e2
source: Delete failed
zh_hans: 删除失败

# Workload_Text_Delete_template_da9a9b
source: Delete template
zh_hans: 删除模板

# Workload_Text_Delete_the_0_template_fb09f8
source: Delete the "{0}" template?
zh_hans: 删除“{0}”模板吗？

# Workload_Text_Deleted_profile_0_c56639
source: Deleted profile "{0}".
zh_hans: 已删除运行配置“{0}”。

# Workload_Text_Deleted_the_0_template_cdabb5
source: Deleted the "{0}" template.
zh_hans: 已删除“{0}”模板。

# Workload_Text_Deploy_a_Kubernetes_YAML_manifest_5794a3
source: Deploy a Kubernetes YAML manifest
zh_hans: 部署 Kubernetes YAML 清单

# Workload_Text_Deployed_a5dc3f
source: Deployed
zh_hans: 已部署

# Workload_Text_Deployment_870a8f
source: Deployment
zh_hans: 部署

# Workload_Text_Deployments_842a46
source: Deployments
zh_hans: 部署

# Workload_Text_Describe_00f7e8
source: Describe
zh_hans: 详细状态

# Workload_Text_Description_526e00
source: Description
zh_hans: 描述

# Workload_Text_Desired_replicas_598a02
source: Desired replicas
zh_hans: 目标副本数

# Workload_Text_Desired_replicas_for_0_306ce6
source: Desired replicas for {0}
zh_hans: {0} 的目标副本数

# Workload_Text_Dev_Containers_5d7690
source: Dev Containers
zh_hans: 开发容器

# Workload_Text_Display_name_2b7f6a
source: Display name
zh_hans: 显示名称

# Workload_Text_Distro_fcad2a
source: Distro:
zh_hans: 发行版：
